# Напишите однострочный генератор словаря, который принимает на вход 
# три списка одинаковой длины: имена str, ставка int, премия str с 
# указанием процентов вида «10.25%». В результате получаем словарь с 
# именем в качестве ключа и суммой премии в качестве значения. Сумма 
# рассчитывается как ставка умноженная на процент премии

names = ['Олег', 'Глеб', 'Егор']
bets = [20_000, 50_000, 22_000]
awards = ['12.5', '10.25', '15.75']

print({name: bet * (float(award) / 100) for name, bet, award in zip(names, bets, awards)})
